def bubble_sort(arr):
    """
    Сортування масиву методом бульбашкового сортування.

    Параметри:
    arr (list): Невідсортований масив.

    Повертає:
    list: Відсортований масив.
    """
    n = len(arr)  # Отримуємо довжину масиву
    for i in range(n):  # Повторюємо процес для кожного елемента масиву
        for j in range(0, n-i-1):  # Порівнюємо кожен елемент з наступним
            if arr[j] > arr[j+1]:  # Якщо поточний елемент більший за наступний
                arr[j], arr[j+1] = arr[j+1], arr[j]  # Міняємо їх місцями
    return arr  # Повертаємо відсортований масив

# Приклад використання
arr = [64, 34, 25, 12, 22, 11, 90]
sorted_arr = bubble_sort(arr)
print("Відсортований масив:")
print(sorted_arr)
